** Defining Local Function in Lisp
   #+BEGIN_SRC lisp
     (flet ((f (n)
	      (+ n 10)))
       (f 5))
   #+END_SRC

   #+RESULTS:
   : 15
   - As with let, you can define one or more functions within the scope of the flet
   #+BEGIN_SRC lisp
     (flet (
	    (f (n)
	      (+ n 10))
	    (g (n)
	      (- n 3)))
       (g (f 5)))
   #+END_SRC

   #+RESULTS:
   : 12
   
   - To make function names available in defined functions, we can use the labels command, its structure is similar to the flet command
     #+BEGIN_SRC lisp
       (labels (
		(f (n)
		  (+ n 10))
		(g (n)
		  (+ (f n) 6)))
	 (g 10))
     #+END_SRC

     #+RESULTS:
     : 26

** The Building Block of Lisp Syntax
   - Symbols
     #+BEGIN_SRC lisp
       (eq 'fool 'FoOL)
     #+END_SRC

     #+RESULTS:
     : T

   - Numbers
   - Strings
     - To indicate a string in Lisp, surround characters with double quotes.
     - Use "princ" to display a string
       #+BEGIN_SRC lisp
	 (princ "Hello World")
       #+END_SRC

       #+RESULTS:
       : Hello World

*** Cons Cells and List Functions
    - The cons Function
      If you want to link any two pieces of data in your Lisp program, you can do that with cons function. When you call cons, the Lisp compiler typically allocates a small chunk of memory, the cons cell that can hold two references to the objects being linked.
      #+BEGIN_SRC lisp
	(cons 'zw 'pdbh)
      #+END_SRC

      #+RESULTS:
      : (ZW . PDBH)
      The dot between the two connected item make this a cons cell. Do not confuse this with a regular list, it just links those two items together.
      
*** Empty Euals False
    - empty list == false, non-empty list == true
    - Because we can easily detect anempty list, we can process lists using recursion.
      #+BEGIN_SRC lisp
	(defun my-length (list)
	  (if list
	      (1+ (my-length (cdr list)))
	      0))

	(my-length '(a b c d e f g))
      #+END_SRC

      #+RESULTS:
      : 7
      
** Describing the Location
   - use assoc function to find the correct item in the alist
     #+BEGIN_SRC lisp
       (assoc 'garden *node*)
     #+END_SRC

     #+RESULTS:
     | GARDEN | (YOU ARE IN A BEAUTIFUL GARDEN. THERE IS A WELL IN FRONT OF YOU) |
     
   - With assoc, we can easily create the describe-location function
     #+BEGIN_SRC lisp
       (defun describe-location (location nodes)
	 (cadr (assoc location nodes)))
       (describe-location 'living-room *node*)
     #+END_SRC

     #+RESULTS:
     | YOU | ARE | IN | THE | LIVING-ROOM. | A | WIZARD | IS | SNORING | LOUDLY | ON | THE | COUCH |
   - Functional programming style
     - A function will reference only parameters or variables declared in the function itself. And it will do nothing besides return a value.
     - By writing functions that don't reference variables in the "outside world" directly and that don't perform any actions other than returning a value, you can write code that can easily be tested in isolation.

*** Describing multiple path as Once
    It could generate descriptions for all edges from a given location by looking up the location from our data structure of edges:
    #+BEGIN_SRC lisp
      (defun describe-edges (location edges)
	(apply #'append (mapcar #'describe-edge (cdr (assoc location edges)))))
      (describe-edges 'living-room *edge*)
    #+END_SRC

    #+RESULTS:
    | THERE | IS | A | DOOR | GOING | WEST | FROM | HERE. | THERE | IS | A | LADDER | GOING | UPSTAIRS | FROM | HERE. |

    - HIGH order function, 'mapcar'
      #+BEGIN_SRC lisp
	(mapcar #'sqrt '(1 2 3 4 5))
      #+END_SRC

      #+RESULTS:
      | 1.0 | 1.4142135 | 1.7320508 | 2.0 | 2.236068 |
      This function takes another function and a list, and then applies this function to every member of a list. The function names we pass into mapcar have the #' symbols, which is shorthand for the function operator.

*** Joining the Descriptions
    It joins several lists into one big list.
    #+BEGIN_SRC lisp
      (append '(zw) '(pd) '(b) '(h))
    #+END_SRC

    #+RESULTS:
    | ZW | PD | B | H |
    A problem of append is that it need each list to be separated list marked seperated using ', to solve this we could use apply.
    #+BEGIN_SRC lisp
      (apply #'append '((1 2) (3) (4 5 6)))
    #+END_SRC

    #+RESULTS:
    | 1 | 2 | 3 | 4 | 5 | 6 |


*** Listing visible objects
    #+BEGIN_SRC lisp
      (defparameter *objects* '(whiskey bucket frog chain))
    #+END_SRC

    #+RESULTS:
    : *OBJECTS*
    
    Also create a second variable to track the location of each object in the form of an alist:
    #+BEGIN_SRC lisp
      (defparameter *object-locations* '((whiskey living-room)
					 (bucket living-room)
					 (chain garden)
					 (frog garden)))
    #+END_SRC

    #+RESULTS:
    : *OBJECT-LOCATIONS*

    A function that lists the objects visiable from a given location:
    #+BEGIN_SRC lisp
      (defun objects-at (loc objs obj-locs)
	;; use labels to define local function
	(labels ((at-loc-p (obj)
		   (eq (cadr (assoc obj obj-locs)) loc)))
	  ;; remove all things from a list for which a passed-in function doesn't return true.
	  (remove-if-not #'at-loc-p objs)))
      ;; the result of this function returns a filtered list of objects consisting of those items for which at-loc-p is true

      (objects-at 'living-room *objects* *object-locations*)
    #+END_SRC

    #+RESULTS:
    | WHISKEY | BUCKET |
    
    "xxx-p" function name means it is boolean function, p stands for predicates.

*** Describing Visible Objects
    Now, we could write a function to describe the objects visible at a given location.
    #+BEGIN_SRC lisp
      (defun describe-objects (loc objs obj-loc)
	(labels ((describe-obj (obj)
		   `(you see a ,obj on the floor.)))
	  (apply #'append (mapcar #'describe-obj (objects-at loc objs obj-loc)))))

      (describe-objects 'living-room *objects* *object-locations*)
    #+END_SRC

    #+RESULTS:
    | YOU | SEE | A | WHISKEY | ON | THE | FLOOR. | YOU | SEE | A | BUCKET | ON | THE | FLOOR. |


